#元组案例1
students = (
    ("S001", "王林", 85, 92, 78),
    ("S002", "李燕", 92, 88, 95),
    ("S003", "十三", 78, 85, 82),
    ("S004", "曾牛", 88, 79, 91),
    ("S005", "周扒", 95, 96, 89),
    ("S006", "王卓", 76, 82, 77),
    ("S007", "红蝶", 89, 91, 94),
    ("S008", "徐立国", 75, 69, 82),
    ("S009", "许木", 86, 89, 98),
    ("S010", "通天", 66, 59, 72)
)


print("学号\t姓名\t语文\t数学\t英语\t总分\t平均分")
for s in students:  # ("S001", "王林", 85, 92, 78)
    total = s[2] + s[3] + s[4]
    avg = total / 3
    print(f"{s[0]}\t{s[1]}\t{s[2]}\t{s[3]}\t{s[4]}\t{total}\t{avg:.1f}")